#ifndef SEnumLib1H
#define SEnumLib1H

#include <algorithm>
#define min std::min
#define max std::max
//при ошибке компиляции определить define STRICT в свойстве проекта
#include <gdiplus.h>
#include <gdiplusimagecodec.h>
#include <gdiplusimaging.h>
#undef min
#undef max


//===============================================================================
//                      Запуск и остановка системы Gdiplus                      |
//===============================================================================
int __fastcall StartGdiplus(void);
//-------------------------------------------------------------------------------
//                      Инициализирует систему Gdiplus                          |
// Возвращает количество незакрытых инициализаций Gdiplus                       |
//-------------------------------------------------------------------------------

int __fastcall StopGdiplus(void);
//-------------------------------------------------------------------------------
//                          Завершает работу Gdiplus                            |
// Возвращает количество незакрытых инициализаций Gdiplus                       |
//-------------------------------------------------------------------------------




//===============================================================================
//                      Сохранение битмапа в тифовском файле                    |
// Полагает, что система Gdiplus уже запущена                                   |
//===============================================================================
bool __fastcall IniSaveBitmap2Tiff(char *filn);
//-------------------------------------------------------------------------------
//            Инициализирует процедуру вывода битмапов в файл *.tiff            |
// Если что-нибудь не получилось - выдает сообщение и возвращает false          |
//-------------------------------------------------------------------------------

void __fastcall SaveBitmap2Tiff(Gdiplus::Bitmap *bm, int npage);
//-------------------------------------------------------------------------------
//                  Выводит очередную страницу в файл *.tiff                    |
// Если npage == 0, то не выводит номер страницы                                |
// Полагает, что если это многостраничный файл, то страница уже выбрана         |
//-------------------------------------------------------------------------------

void __fastcall StopSaveBitmap2Tiff(void);
//-------------------------------------------------------------------------------
//                      Закрывает вывод страниц в *.tiff                        |
//-------------------------------------------------------------------------------





//===============================================================================
//                  Загрузка, листание, выгрузка тифовского файла               |
// Полагает, что система Gdiplus уже запущена                                   |
//===============================================================================
extern int LoadTiffFileNpages;         // Количество страниц в тифовском файле

Gdiplus::Bitmap * __fastcall LoadTiffFile(char *filn);
//-------------------------------------------------------------------------------
//                      Загружает тифовский файл для листания                   |
//-------------------------------------------------------------------------------

void __fastcall SetTiffFilePage(int npage);
//-------------------------------------------------------------------------------
//                  Устанавливает номер страницы тифовского файла               |
// Надо ли говорить, что номер страницы не должен быть больше Npages            |
//-------------------------------------------------------------------------------

void __fastcall ReleaseTiffFile(void);
//-------------------------------------------------------------------------------
//              Освобождает ресурсы, связанные с загруженным файлом             |
// При этом и fbm тоже освобождается!                                           |
//-------------------------------------------------------------------------------








TPoint __fastcall FindLastCell2(TPoint Max);
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------

void __fastcall TestTiff(TImage *img);
//-------------------------------------------------------------------------------
//          Проверяет принципиальную возможность работать с tiff                |
//-------------------------------------------------------------------------------

void __fastcall IncImageIndex(void);
void __fastcall DecImageIndex(void);


void __fastcall StopSaveBitmap2Tiff(void);
//-------------------------------------------------------------------------------
//                      Закрывает вывод страниц в *.tiff                        |
//-------------------------------------------------------------------------------

#endif